In [2]:
print("* ASSIGNMENT_PANDAS_ADVANCE *")

* ASSIGNMENT_PANDAS_ADVANCE *

In [3]:
import pandas as pd

In [4]:
print("Q_1_ANS:- ")

Q_1_ANS:-

In [5]:
df = pd.read_csv('IPL_data_2008.csv')

In [6]:
df.head()

,Unnamed: 0.1,Unnamed: 0,id,season,city,date,team1,team2,toss_winner,toss_decision,...,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3,points,Dream_points
0,0,NaN,1,2008,Bangalore,2008-04-18,Kolkata Knight Riders,Royal Challengers Bangalore,Royal Challengers Bangalore,field,...,Kolkata Knight Riders,140,0,BB McCullum,M Chinnaswamy Stadium,Asad Rauf,RE Koertzen,NaN,0,140
1,1,NaN,2,2008,Chandigarh,2008-04-19,Chennai Super Kings,Kings XI Punjab,Chennai Super Kings,bat,...,Chennai Super Kings,33,0,MEK Hussey,"Punjab Cricket Association Stadium, Mohali",MR Benson,SL Shastri,NaN,0,33
2,2,NaN,3,2008,Delhi,2008-04-19,Rajasthan Royals,Delhi Daredevils,Rajasthan Royals,bat,...,Delhi Daredevils,0,9,MF Maharoof,Feroz Shah Kotla,Aleem Dar,GA Pratapkumar,NaN,0,9
3,3,NaN,4,2008,Mumbai,2008-04-20,Mumbai Indians,Royal Challengers Bangalore,Mumbai Indians,bat,...,Royal Challengers Bangalore,0,5,MV Boucher,Wankhede Stadium,SJ Davis,DJ Harper,NaN,0,5
4,4,NaN,5,2008,Kolkata,2008-04-20,Deccan Chargers,Kolkata Knight Riders,Deccan Chargers,bat,...,Kolkata Knight Riders,0,5,DJ Hussey,Eden Gardens,BF Bowden,K Hariharan,NaN,0,5

In [7]:
df[['city']]

           city
0     Bangalore
1    Chandigarh
2         Delhi
3        Mumbai
4       Kolkata
..          ...
572      Raipur
573   Bangalore
574       Delhi
575       Delhi
576   Bangalore

[577 rows x 1 columns]

In [8]:
df.describe()

,Unnamed: 0.1,Unnamed: 0,id,season,dl_applied,win_by_runs,win_by_wickets,umpire3,points,Dream_points
count,577.000000,0.0,577.000000,577.000000,577.000000,577.000000,577.000000,0.0,577.0,577.000000
mean,288.000000,NaN,289.000000,2012.029463,0.025997,13.715771,3.363951,NaN,0.0,17.079723
std,166.709828,NaN,166.709828,2.486247,0.159263,23.619282,3.416049,NaN,0.0,21.842648
min,0.000000,NaN,1.000000,2008.000000,0.000000,0.000000,0.000000,NaN,0.0,0.000000
25%,144.000000,NaN,145.000000,2010.000000,0.000000,0.000000,0.000000,NaN,0.0,6.000000
50%,288.000000,NaN,289.000000,2012.000000,0.000000,0.000000,3.000000,NaN,0.0,8.000000
75%,432.000000,NaN,433.000000,2014.000000,0.000000,20.000000,6.000000,NaN,0.0,20.000000
max,576.000000,NaN,577.000000,2016.000000,1.000000,144.000000,10.000000,NaN,0.0,144.000000

In [9]:
df.set_index('id',inplace=True)

In [10]:
df.head()

,Unnamed: 0.1,Unnamed: 0,season,city,date,team1,team2,toss_winner,toss_decision,result,...,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3,points,Dream_points
id,,,,,,,,,,,,,,,,,,,,,
1,0,NaN,2008,Bangalore,2008-04-18,Kolkata Knight Riders,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,...,Kolkata Knight Riders,140,0,BB McCullum,M Chinnaswamy Stadium,Asad Rauf,RE Koertzen,NaN,0,140
2,1,NaN,2008,Chandigarh,2008-04-19,Chennai Super Kings,Kings XI Punjab,Chennai Super Kings,bat,normal,...,Chennai Super Kings,33,0,MEK Hussey,"Punjab Cricket Association Stadium, Mohali",MR Benson,SL Shastri,NaN,0,33
3,2,NaN,2008,Delhi,2008-04-19,Rajasthan Royals,Delhi Daredevils,Rajasthan Royals,bat,normal,...,Delhi Daredevils,0,9,MF Maharoof,Feroz Shah Kotla,Aleem Dar,GA Pratapkumar,NaN,0,9
4,3,NaN,2008,Mumbai,2008-04-20,Mumbai Indians,Royal Challengers Bangalore,Mumbai Indians,bat,normal,...,Royal Challengers Bangalore,0,5,MV Boucher,Wankhede Stadium,SJ Davis,DJ Harper,NaN,0,5
5,4,NaN,2008,Kolkata,2008-04-20,Deccan Chargers,Kolkata Knight Riders,Deccan Chargers,bat,normal,...,Kolkata Knight Riders,0,5,DJ Hussey,Eden Gardens,BF Bowden,K Hariharan,NaN,0,5

In [11]:
print("Q_2_ANS:- ")

Q_2_ANS:-

In [12]:
 df1 = pd.DataFrame( {'A':[78,85,96,80,86], 'B':[84,94,89,83,86],'C':[86,97,96,72,83]},index=[1,2,3,4,5])

In [13]:
df1

    A   B   C
1  78  84  86
2  85  94  97
3  96  89  96
4  80  83  72
5  86  86  83

In [14]:
 df1.reindex([1,3,5,2,4])

    A   B   C
1  78  84  86
3  96  89  96
5  86  86  83
2  85  94  97
4  80  83  72

In [15]:
print("Q_3_ANS:- ")

Q_3_ANS:-

In [16]:
df2 = pd.DataFrame( {'values':[10,20,30,40,50]})

In [17]:
df2

   values
0      10
1      20
2      30
3      40
4      50

In [47]:
df2['values'].rolling(window=3).sum()

0      NaN
1      NaN
2     60.0
3     90.0
4    120.0
Name: values, dtype: float64

In [48]:
print("Q_4_ANS:- ")

Q_4_ANS:-

In [63]:
df3 = pd.DataFrame({"Text":["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.","I am a data scientist","I want to become a blockchain developer"]})

In [64]:
df3

                                                Text
0  Data Science Masters course is highly curated ...
1                              I am a data scientist
2            I want to become a blockchain developer

In [65]:
df3['Word_Count'] = df3['Text'].apply(lambda x :len(x.split()))

In [66]:
df3

                                                Text  Word_Count
0  Data Science Masters course is highly curated ...         104
1                              I am a data scientist           5
2            I want to become a blockchain developer           7

In [77]:
print("Q_5_ANS:- Size and shape of a dataframe in pandas python: Size of a dataframe is the number of fields in the dataframe which is nothing but number of rows * number of columns. Shape of a dataframe gets the number of rows and number of columns of the dataframe.\n\nLets see on how to\n\nGet the Size of the dataframe in pandas python.\nGet the shape of the dataframe in pandas python.\n\nGet size of the dataframe in pandas python:\n\ndf3.size\n\nResult:\n6\n\nGet shape of the dataframe in pandas python:\n\ndf3.shape\n\nResult:\n(3, 2)")

Q_5_ANS:- Size and shape of a dataframe in pandas python: Size of a dataframe is the number of fields in the dataframe which is nothing but number of rows * number of columns. Shape of a dataframe gets the number of rows and number of columns of the dataframe.

Lets see on how to

Get the Size of the dataframe in pandas python.
Get the shape of the dataframe in pandas python.

Get size of the dataframe in pandas python:

df3.size

Result:
6

Get shape of the dataframe in pandas python:

df3.shape

Result:
(3, 2)

In [73]:
df3.size

6

In [74]:
df3.shape

(3, 2)

In [81]:
print("Q_6_ANS:- Pandas read_excel() function is used for reading the excel files. Files can be imported using a URL link or can be directly imported from the disk. There are different parameters like io for path,sheet_name for specifying the name of the sheet, etc. for reading the file.\n\nSyntex:\n\ndf = pd.read_exel('File_name') ")

Q_6_ANS:- Pandas read_excel() function is used for reading the excel files. Files can be imported using a URL link or can be directly imported from the disk. There are different parameters like io for path,sheet_name for specifying the name of the sheet, etc. for reading the file.

Syntex:

df = pd.read_exel('File_name')

In [82]:
print("Q_7_ANS:- ")

Q_7_ANS:-

In [83]:
df4 = pd.DataFrame({'Email': ['codebyyash0803@gmail.com', 'yashingle9021@yahoo.com', 'sumitagrawal456@gmail.com']})

In [84]:
df4

                       Email
0   codebyyash0803@gmail.com
1    yashingle9021@yahoo.com
2  sumitagrawal456@gmail.com

In [85]:
df4['Username'] =df4.Email.str.extract("(.*)@")

In [86]:
df4

                       Email         Username
0   codebyyash0803@gmail.com   codebyyash0803
1    yashingle9021@yahoo.com    yashingle9021
2  sumitagrawal456@gmail.com  sumitagrawal456

In [91]:
print("Q_8_ANS:- ")

Q_8_ANS:-

In [297]:
data = pd.DataFrame({'A': [3,8,6,2,9],'B': [5,2,9,3,1],'C':[1,7,4,5,2]})

In [298]:
data

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [300]:
def test(x):
    for i in x :
        if i >5:
            return i
data1 = data[['A']].apply(test)

In [301]:
def test(x):
    for i in x :
        if i <5:
            return i
    
data2 = data[['B']].apply(test)

In [302]:
def test(x):
    for i in x :
        if i >5:
            return i
    
data3 = data[['C']].apply(test)

In [303]:
def test(x):
    for i in x :
        if i == 9:
            return i
    
data4 = data[['A']].apply(test)

In [304]:
def test(x):
    for i in x :
        if i == 1:
            return i
    
data5 = data[['B']].apply(test)

In [305]:
def test(x):
    for i in x :
        if i == 2:
            return i
    
data6 = data[['B']].apply(test)

In [310]:
df5 = pd.DataFrame({'A':[data1[0],data4[0]],'B':[data2[0],data5[0]],'C':[data3[0],data6[0]]},index = [1,4])

In [311]:
df5

   A  B  C
1  8  2  7
4  9  1  2

In [312]:
print("Q_9_ANS:- ")

Q_9_ANS:-

In [313]:
df6 = pd.DataFrame({'Values': [3,8,6,2,9]})

In [320]:
def m(x):
    return x.mean()

In [321]:
df6.apply(m)

Values    5.6
dtype: float64

In [322]:
def s(x):
    return x.std()

In [323]:
df6.apply(s)

Values    3.04959
dtype: float64

In [324]:
def med(x):
    return x.median()

In [325]:
df6.apply(med)

Values    6.0
dtype: float64

In [326]:
print("Q_10_ANS:- ")

Q_10_ANS:-

In [341]:

reliance = pd.read_csv('RELIANCE.NS_.csv', index_col='Date',parse_dates=True)

In [346]:

reliance = reliance['Sale'].to_frame()

reliance['MovingAverage'] = reliance['Sale'].rolling(7).mean()

reliance.dropna(inplace=True)

reliance

                 Sale  MovingAverage
Date
2016-07-29  4444057.0   4.525321e+06
2016-08-01  3681961.0   4.608863e+06
2016-08-02  3558227.0   4.662306e+06
2016-08-03  5479056.0   4.901673e+06
2016-08-04  4701579.0   4.879997e+06
...               ...            ...
2021-07-14  3937768.0   4.257872e+06
2021-07-15  4360415.0   4.216879e+06
2021-07-16  4074206.0   4.109633e+06
2021-07-19  3855577.0   3.922988e+06
2021-07-20  3110610.0   3.771520e+06

[1214 rows x 2 columns]

In [347]:
print("Q_11_ANS:- ")

Q_11_ANS:-

In [348]:
date = pd.date_range(start = '2023-01-01',end = '2023-01-05')
df7 = pd.DataFrame({'Date':date})

In [350]:
df7['Weekday'] = ['Sunday','Monday','Tuesday','Wednesday','Thusday']

In [351]:
df7

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05    Thusday

In [358]:
print("Q_12_ANS:- ")

Q_12_ANS:-

In [415]:
import pandas as pd
import datetime

start_date = '2023-01-01'
end_date = '2023-01-31'
hour = 8
minute = 38

# Create a range of dates and times using pandas
dates = pd.date_range(start=start_date, end=end_date, freq='D', normalize=True)
times = pd.date_range(start='{}:{}'.format(hour, minute), end='{}:{}'.format(hour, minute), freq='H', normalize=True)

# Combine the dates and times into a single timestamp for each day
timestamps = [datetime.datetime.combine(date.date(), time.time()) for date in dates for time in times]

# Create a DataFrame containing the timestamps
df = pd.DataFrame({'timestamp': timestamps})

# Print the resulting DataFrame
df

    timestamp
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

In [396]:
print("Q_13_ANS:- As Pandas is dependent on the NumPy library, we need to import this dependency.\n\nPandas is a Python library for data analysis. Started by Wes McKinney in 2008 out of a need for a powerful and flexible quantitative analysis tool, pandas has grown into one of the most popular Python libraries. It has an extremely active community of contributors\n\nPandas is built on top of two core Python libraries—matplotlib for data visualization and NumPy for mathematical operations. Pandas acts as a wrapper over these libraries, allowing you to access many of matplotlib's and NumPy's methods with less code. For instance, pandas' .plot() combines multiple matplotlib methods into a single method, enabling you to plot a chart in a few lines.\n\nBefore pandas, most analysts used Python for data munging and preparation, and then switched to a more domain specific language like R for the rest of their workflow. Pandas introduced two new types of objects for storing data that make analytical tasks easier and eliminate the need to switch tools: Series, which have a list-like structure, and DataFrames, which have a tabular structure. ")

Q_13_ANS:- As Pandas is dependent on the NumPy library, we need to import this dependency.

Pandas is a Python library for data analysis. Started by Wes McKinney in 2008 out of a need for a powerful and flexible quantitative analysis tool, pandas has grown into one of the most popular Python libraries. It has an extremely active community of contributors

Pandas is built on top of two core Python libraries—matplotlib for data visualization and NumPy for mathematical operations. Pandas acts as a wrapper over these libraries, allowing you to access many of matplotlib's and NumPy's methods with less code. For instance, pandas' .plot() combines multiple matplotlib methods into a single method, enabling you to plot a chart in a few lines.

Before pandas, most analysts used Python for data munging and preparation, and then switched to a more domain specific language like R for the rest of their workflow. Pandas introduced two new types of objects for storing data that make analytical tasks easier and eliminate the need to switch tools: Series, which have a list-like structure, and DataFrames, which have a tabular structure.